import time




# 设计欢迎的界面
def welcomView():
    print("************************************************")
    print("************************************************")
    print("*****                                      *****")
    print("*****           欢迎进入温氏银行系统        *****")
    print("*****                                      *****")
    print("************************************************")
    print("************************************************")
    # 让用户多看一眼
    time.sleep(2)

# 登陆页面
def loginView():
    # 模拟的账号和密码
    adminUserName = 1
    adminPasswd = 1

    username = int(input("请输入您的账号:"))
    passwd = int(input("请输入您的密码:"))
#   验证账号和密码

    if not username ==  adminUserName: #账户不正确
        print("您输入的账号不存在")
        return -1    #用-1表示输入的结果不对
    if not passwd == adminPasswd:
        print("您输入的密码不存在")
        return -1
    print("恭喜您,登陆成功")
    return 1

# 显示主功能页面
def funcView():
    print("************************************************")
    print("*****       开户(1)        查询(2)          *****")
    print("*****       存款(3)        取款(4)          *****")
    print("*****       转账(5)        改密(6)          *****")
    print("*****       锁定(7)        解锁(8)          *****")
    print("*****       补卡(9)        注销(0)          *****")
    print("*****              退出(q)                   *****")










